#include <iostream>
#include <locale>
#include <stdio.h>
#include <dirent.h>



using namespace std;

int main(void)
{
	setlocale(LC_CTYPE , "ukr");


    // Оголошення констант та змiнних:
    const float pi = 3.14159; // оголошення константи pi
    float r; // радiус основи прямого кругового цилiндра
    float h; // висота прямого кругового цилiндра
    float sb; // площа бiчної поверхнi цилiндра
    float sp; // площа повної поверхнi цилiндра
    float v; // об'єм цилiндра

    // Ввiд заданих величин:
    printf(" Введiть радiус основи цилiндра: ");
    scanf("%f", &r);  // Используем стандартный scanf для Linux
    printf(" Введiть висоту цилiндра: ");
    scanf("%f", &h);  // Используем стандартный scanf для Linux

    // Обчислення параметрiв цилiндра:
    sb = 2 * pi * r * h;
    sp = sb + 2 * pi * r * r * h;
    v = pi * r * h * h;

    // Друк результатiв у виглядi таблицi:
    printf("\n Вхiднi величини та результати обчислень:\n");
    printf(" I-------------------------------------------I\n");
    printf(" I Вхiднi величини: I\n");
    printf(" I-------------------------------------------I\n");
    printf(" I Радiус основи цилiндра I %6.2f I\n", r);
    printf(" I--------------------------------------------\n");

    printf(" I Висота цилiндра I %8.4f I\n", h);
    printf(" I-------------------------------------------I\n");
    printf(" IРезультати обчислень: I\n");
    printf(" I-------------------------------------------I\n");
    printf(" I Бiчна поверхня цилiндра I %8.3f I\n", sb);
    printf(" I-------------------------------------------I\n");
    printf(" I Повна поверхня цилiндра I %3.7f I\n", sp);
    printf(" I-------------------------------------------I\n");
    printf(" I Об’єм цилiндра I %8.2f I\n", v);
    printf(" I-------------------------------------------I\n");

}
